{
"Ada Lovelace": {
"id" : 0,
"country": "England",
"tags" : ["math", "computers", "London"],
"born" : 1815,
"description": "Augusta Ada King, Countess of Lovelace (10 December 1815 – 27 November 1852), born Augusta Ada Byron and now commonly known as Ada Lovelace, was an English mathematician and writer chiefly known for her work on Charles Babbage's early mechanical general-purpose computer, the Analytical Engine. Her notes on the engine include what is recognised as the first algorithm intended to be carried out by a machine. Because of this, she is often described as the world's first computer programmer.Lovelace was born 10 December 1815 as the only child of the poet Lord Byron and his wife Anne Isabella Byron. All Byron's other children were born out of wedlock to other women. Byron separated from his wife a month after Ada was born and left England forever four months later, eventually dying of disease in the Greek War of Independence when Ada was eight years old. Ada's mother remained bitter at Lord Byron and promoted Ada's interest in mathematics and logic in an effort to prevent her from developing what she saw as the insanity seen in her father, but Ada remained interested in him despite this (and was, upon her eventual death, buried next to him at her request). Ada described her approach as 'poetical science' and herself as an 'Analyst (& Metaphysician)'.As a young adult, her mathematical talents led her to an ongoing working relationship and friendship with fellow British mathematician Charles Babbage, and in particular Babbage's work on the Analytical Engine. Between 1842 and 1843, she translated an article by Italian military engineer Luigi Menabrea on the engine, which she supplemented with an elaborate set of notes of her own, simply called Notes. These notes contain what many consider to be the first computer program—that is, an algorithm designed to be carried out by a machine. Lovelace's notes are important in the early history of computers. She also developed a vision on the capability of computers to go beyond mere calculating or number-crunching while others, including Babbage himself, focused only on those capabilities. Her mind-set of 'poetical science' led her to ask basic questions about the Analytical Engine (as shown in her notes) examining how individuals and society relate to technology as a collaborative tool. ",
"picture" : "http://upload.wikimedia.org/wikipedia/commons/thumb/a/a4/Ada_Lovelace_portrait.jpg/640px-Ada_Lovelace_portrait.jpg",
"wikiLink" : "http://en.wikipedia.org/wiki/Ada_Lovelace"
},
" Henrietta Swan Leavitt": {
"id" : 1,
"country": "United States",
"tags" : ["astronomy", "computers", "Massachusettes"],
"born" : 1868,
"description":"Henrietta Swan Leavitt (July 4, 1868 – December 12, 1921) was an American astronomer. A graduate of Radcliffe College, Leavitt started working at the Harvard College Observatory as a 'computer' in 1893, examining photographic plates in order to measure and catalog the brightness of stars. Leavitt discovered the relation between the luminosity and the period of Cepheid variable stars. Though she received little recognition in her lifetime, it was her discovery that first allowed astronomers to measure the distance between the Earth and faraway galaxies. After Leavitt's death, Edwin Hubble used the luminosity-period relation for Cepheids to determine that the Milky Way is not the only galaxy in the observable universe, and that the universe is expanding (see Hubble's law).",
"picture" : "http://upload.wikimedia.org/wikipedia/commons/3/3b/Leavitt_aavso.jpg",
"wikiLink" : "http://en.wikipedia.org/wiki/Henrietta_Swan_Leavitt"
},
"Grete Hermann": {
"id" : 2,
"country": "German",
"tags" : ["math", "Bremen"],
"born" : 1901,
"description":"Grete (Henry-)Hermann (* March 2, 1901 in Bremen, † April 15, 1984 in Bremen) was a German mathematician and philosopher noted for her work in mathematics, physics, philosophy and education. She is noted for her early philosophical work on the foundations of quantum mechanics, and is now known most of all for an early, but long-ignored refutation of a no-hidden-variable theorem by John von Neumann. The disputed theorem and the fact that Hermann's critique of this theorem remained nearly unknown for decades are considered to have had a strong influence on the development of quantum mechanics.",
"picture" : "http://upload.wikimedia.org/wikipedia/en/e/ea/Grete_Hermann.jpg",
"wikiLink" : "http://en.wikipedia.org/wiki/Grete_Hermann"
},
"Hedy Lamarr": {
"id" : 3,
"country": "Austria-Hungry",
"tags" : ["math", "computers", "Vienna", "Actress", "United States"],
"born" : 1914,
"description":"Hedy Lamarr (9 November 1914 – 19 January 2000) was an Austrian-born American actress and inventor. After an early film career in Germany, Lamarr moved to Hollywood at the initiation of MGM head, Louis B. Mayer, where she soon became a star during MGM's 'Golden Age.' Max Reinhardt, who directed her in Berlin, called her the 'most beautiful woman in Europe,' having 'strikingly dark exotic looks', a sentiment widely shared by her audiences and critics. She garnered a degree of fame and notoriety after starring in the Czech director Gustav Machatý's Ecstasy, a 1933 film which featured closeups of her acting during orgasm in one scene, as well as full frontal nude shots of her in another scene. Lamarr was also notable as co-inventor, with composer George Antheil, of an early technique for spread spectrum communications and frequency hopping, which paved the way for today's wireless communications and which, upon its invention in 1941, was deemed so vital to national defense that government officials would not allow publication of its details. At the Electronic Frontier Foundation's Sixth Pioneer Awards in 1997, she and George Antheil were honoured with special awards for their 'trail-blazing development of a technology that has become a key component of wireless data systems.'",
"picture" : "http://upload.wikimedia.org/wikipedia/commons/thumb/d/de/Hedy_Lamarr-Algiers-38.JPG/640px-Hedy_Lamarr-Algiers-38.JPG",
"wikiLink" : "http://en.wikipedia.org/wiki/Hedy_Lamarr"
}
}